In [ ]:
###Functions

-- Resuable block of code

In [6]:
a = "jake"
n = len(a)

n_num = 1
for i in range(1, n+1):
    n_num = i * n_num
print(n_num)

24

In [10]:
def factorial_value(name):
    n_num = 1
    for i in range(1, len(name)+1):
        n_num = i * n_num
    return n_num

b = factorial_value("mathew")
print(b)

720

In [17]:
lst_dict = [{"name":"jake", "age":40, "color":"white"},
            {"name":"klinneth", "age":28, "color":"brown"},
            {"name":"damian", "age":30, "color":"blue"},
            {"name":"Tony", "age":32, "color":"red"}]
print(lst_dict)

[{'name': 'jake', 'age': 40, 'color': 'white'}, {'name': 'klinneth', 'age': 28, 'color': 'brown'}, {'name': 'damian', 'age': 30, 'color': 'blue'}, {'name': 'Tony', 'age': 32, 'color': 'red'}]

In [14]:
for i in lst_dict:
    for n, t in i.items():
        if i["color"][0] == "b":
            print(i)
        break

{'name': 'klinneth', 'age': 28, 'color': 'brown'}
{'name': 'damian', 'age': 30, 'color': 'blue'}

In [18]:
def get_bcolors(lst_dict):
    b_list = []
    for i in lst_dict:
        for n, t in i.items():
            if i["color"][0] == "b":
                b_list.append(i)
            break
    return b_list

In [19]:
b = get_bcolors(lst_dict)
print(b)

[{'name': 'klinneth', 'age': 28, 'color': 'brown'}, {'name': 'damian', 'age': 30, 'color': 'blue'}]

In [41]:
arr_num = ["kate", 10, "ben", 10, 10, 6, "kate", "ben", "ben", 10, "ben", "ben", "kate", "ben"]

In [53]:
def collector_function(arr_num):
    return arr_num


def get_hashtable(arr_num):
    dict_val = {}
    for i in arr_num:
        dict_val[i] = dict_val.get(i, 0) + 1
    return dict_val


def get_values(dict_val):
    values = []
    for i, n in dict_val.items():
        values.append(n)
    return values

def max_val(values):
    values.sort()
    max_val = values[-1]
    return max_val

def modal_val(dict_val, max_val):
    for i, p in dict_val.items():
        if p == max_val:
            return i
        
        
arrys = [1, "jake", 7, 18, 7, "b"]


p_collect = collector_function(arr_num)      
k = get_hashtable(p_collect)
y = get_values(k)
x_sort = max_val(y)
modal_t = modal_val(k, x_sort)
print(modal_t)

6

In [69]:
dict_data = [{"id":1001, "car":"mercedes-benz", "credit":95},
             {"id":1003, "car":"venza", "credit":75},
             {"id":1006, "car":"tingo", "credit":80}]

dict_data2 = [{"id":1001, "status":"married"},
             {"id":1003, "status":"un-married"},
             {"id":1006, "status":"married"}]

array = [[1006, "jake"],
         [1001, "ben"],
         [1003, "suzzy"],
         [1002, "kate"]]

In [70]:
print(dict_data)
print(array)
print(dict_data2)

[{'id': 1001, 'car': 'mercedes-benz', 'credit': 95}, {'id': 1003, 'car': 'venza', 'credit': 75}, {'id': 1006, 'car': 'tingo', 'credit': 80}]
[[1006, 'jake'], [1001, 'ben'], [1003, 'suzzy'], [1002, 'kate']]
[{'id': 1001, 'status': 'married'}, {'id': 1003, 'status': 'un-married'}, {'id': 1006, 'status': 'married'}]

In [72]:
import pandas as pd

def get_df1(dict_data):   ####converting a json to dataframe
    df1 = pd.DataFrame(dict_data)
    return df1


def get_df2(array):
    df2 = pd.DataFrame(array)
    df2.columns = ["id", "name"]
    return df2


def join_onKey(df2, df1, key):
    df3 = pd.merge(df2, df1, on=key)
    return df3

data = get_df1(dict_data)
data2 = get_df2(array)
df_data = get_df1(dict_data2)
merged_data = join_onKey(df2, df1, "id")
new_merged = pd.merge(merged_data, df_data, on="id")
#merged_data
#df_data
new_merged

     id   name            car  credit      status
0  1006   jake          tingo      80     married
1  1001    ben  mercedes-benz      95     married
2  1003  suzzy          venza      75  un-married

In [61]:
df2 = pd.DataFrame(array)
df2.columns = ["id", "name"]
df2

     id   name
0  1006   jake
1  1001    ben
2  1003  suzzy
3  1002   kate

In [63]:
df3 = pd.merge(df2, df1, on="id")
df3

     id   name            car  credit
0  1006   jake          tingo      80
1  1001    ben  mercedes-benz      95
2  1003  suzzy          venza      75

In [ ]:
###Recursive functions
### Pandas 
### Date time libraries


##classes
### integrating python to postgresl ==> ETL/LTE